Taxi/test_selfemployed_fns_proxy/static/test_fns_client/requests/reg_partner.xml

<?xml version='1.0' encoding='utf-8'?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
  <soap-env:Body>
    <ns0:SendMessageRequest
        xmlns:ns0="urn://x-artefacts-gnivc-ru/inplat/servin/OpenApiAsyncMessageConsumerService/types/1.0">
      <ns0:Message>
        <ns1:PostPlatformRegistrationRequest
            xmlns:ns1="urn://x-artefacts-gnivc-ru/ais3/SMZ/SmzPartnersIntegrationService/types/1.0">
          <ns1:PartnerName>TAXI</ns1:PartnerName>
          <ns1:PartnerType>PARTNER</ns1:PartnerType>
          <ns1:PartnerConnectable>False</ns1:PartnerConnectable>
          <ns1:PartnerImage>TE9HTw==</ns1:PartnerImage>
          <ns1:Inn>TAXI_INN</ns1:Inn>
          <ns1:Phone>TAXI_PHONE</ns1:Phone>
        </ns1:PostPlatformRegistrationRequest>
      </ns0:Message>
    </ns0:SendMessageRequest>
  </soap-env:Body>
</soap-env:Envelope>
