Taxi/test_selfemployed_fns_proxy/fns_message_templates/get_message_request.xml

<?xml version='1.0' encoding='utf-8'?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
  <soap-env:Body>
    <ns0:GetMessageRequest
        xmlns:ns0="urn://x-artefacts-gnivc-ru/inplat/servin/OpenApiAsyncMessageConsumerService/types/1.0">
      <ns0:MessageId>{message_id}</ns0:MessageId>
    </ns0:GetMessageRequest>
  </soap-env:Body>
</soap-env:Envelope>
