Taxi/test_fns_client/requests/bind_by_phone.xml

<?xml version='1.0' encoding='utf-8'?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
  <soap-env:Body>
    <ns0:SendMessageRequest
        xmlns:ns0="urn://x-artefacts-gnivc-ru/inplat/servin/OpenApiAsyncMessageConsumerService/types/1.0">
      <ns0:Message>
        <ns1:PostBindPartnerWithPhoneRequest
            xmlns:ns1="urn://x-artefacts-gnivc-ru/ais3/SMZ/SmzPartnersIntegrationService/types/1.0">
          <ns1:Phone>PHONE</ns1:Phone>
          <ns1:Permissions>PERM</ns1:Permissions>
        </ns1:PostBindPartnerWithPhoneRequest>
      </ns0:Message>
    </ns0:SendMessageRequest>
  </soap-env:Body>
</soap-env:Envelope>
